#include <SFML/Graphics.hpp>
#include "Engine.h"

using namespace sf;


int main()
{
	
	Engine engine;
	
	engine.start();

	return 0;
}


/**********************************TODO****************************************
*1)UI :
*-сделать кнопки нажимаемыми. 
*-интерфейсные приблуды - выводящими справочную информацию.
*-как влиять на время и останавливать игру
*
*3)подстроить cell под размеры текстуры
*
*2)UI для Cells. Как???????????????????????????????????
*-отображение кол-ва травы
*-CGI
*-кол-ва овец
*
*4)как животные будут регистрироваться в cells?
*
*5) задокументировать все классы)))
*
*6) Тексутры времен года для field
*
*/


/*********DONE**************
*
*/